{
  "backend/main.mo": "Actor storing registration forms in a list with methods to submit forms, fetch all registrations, and return analytics like total count.",
  "backend/migration.mo": "Migration module initializing a new actor state with an empty registration list.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of all frontend files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, dark mode variables, and global styling utilities.",
  "frontend/index.html": "HTML entry point setting up the root container and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main SPA component handling navigation, admin credential gating, and rendering home, registration, analytics, or registration detail pages.",
  "frontend/src/components/AdminCredentialDialog.tsx": "Credential dialog UI for validating admin username and password with error handling.",
  "frontend/src/components/ContactSection.tsx": "Contact section with email and WhatsApp cards, gradient styling, and age requirement notice.",
  "frontend/src/components/QuoteCallout.tsx": "Reusable quote component displaying highlighted quoted text with author attribution.",
  "frontend/src/components/ServicesGrid.tsx": "Displays a grid of service cards with icons, titles, and descriptions using a predefined services list.",
  "frontend/src/components/TopNav.tsx": "Implements a responsive top navigation bar with smooth scrolling, mobile menu handling, and optional registration button.",
  "frontend/src/components/WhyChooseMe.tsx": "Renders a grid of reasons with icons and descriptions explaining the benefits of the service.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAdminGate.ts": "Provides simple admin authentication using hardcoded usernames and password, tracking authorization state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and provides identity context to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting registrations, fetching all registrations, and retrieving analytics via the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind and defines light/dark theme CSS variables for consistent app styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminAnalytics.tsx": "Displays an admin analytics dashboard showing total registrations with loading and error states.",
  "frontend/src/pages/AdminRegistrationDetails.tsx": "Displays all stored registrations with loading, error, empty, and table states using data from useGetAllRegistrations. Provides navigation back home and handles UI for admin viewing of submissions.",
  "frontend/src/pages/WorkFromHomeRegistration.tsx": "Implements a multi‑field registration form with validation, submission to backend via useSubmitRegistration, and a success confirmation screen. Manages form state, errors, and input handling.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins including typography, container queries, and custom animations. Defines extended design tokens and responsive container settings.",
  "project_state.json": "Represents project metadata, existing features, and pending admin-related feature requests for the Smart Earning Hub app. Tracks schema version, requirements, issues, and overall project state."
}